In [1]:
import pandas as pd
import numpy as np

In [2]:
ride_sharing = pd.read_csv("J:/Data science/datacamp/clean data in python/ride_sharing_new.csv")
ride_sharing.head(3)

,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male

In [3]:
ride_sharing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   duration         25760 non-null  object
 1   station_A_id     25760 non-null  int64
 2   station_A_name   25760 non-null  object
 3   station_B_id     25760 non-null  int64
 4   station_B_name   25760 non-null  object
 5   bike_id          25760 non-null  int64
 6   user_type        25760 non-null  int64
 7   user_birth_year  25760 non-null  int64
 8   user_gender      25760 non-null  object
dtypes: int64(5), object(4)
memory usage: 1.8+ MB

In [4]:
ride_sharing['user_type'].value_counts()

2    12972
3     6502
1     6286
Name: user_type, dtype: int64

In [5]:
ride_sharing['user_type'].describe()

count    25760.000000
mean         2.008385
std          0.704541
min          1.000000
25%          2.000000
50%          2.000000
75%          3.000000
max          3.000000
Name: user_type, dtype: float64

1 for free riders.
2 for pay per ride.
3 for monthly subscribers.

The user_type column has an finite set of possible values that represent groupings of data, it should be converted to category.

Convert user_type into categorical by assigning it the 'category' data type and store it in the user_type_cat column.
Make sure you converted user_type_cat correctly by using an assert statement.

In [6]:
ride_sharing['user_type_cat'] = ride_sharing['user_type'].astype('category')
assert ride_sharing['user_type_cat'].dtypes == 'category'

In [7]:
ride_sharing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   duration         25760 non-null  object
 1   station_A_id     25760 non-null  int64
 2   station_A_name   25760 non-null  object
 3   station_B_id     25760 non-null  int64
 4   station_B_name   25760 non-null  object
 5   bike_id          25760 non-null  int64
 6   user_type        25760 non-null  int64
 7   user_birth_year  25760 non-null  int64
 8   user_gender      25760 non-null  object
 9   user_type_cat    25760 non-null  category
dtypes: category(1), int64(5), object(4)
memory usage: 1.8+ MB

In [8]:
ride_sharing['user_type_cat'].describe()

count     25760
unique        3
top           2
freq      12972
Name: user_type_cat, dtype: int64

In [9]:
ride_sharing['duration'].head()

0    12 minutes
1    24 minutes
2     8 minutes
3     4 minutes
4    11 minutes
Name: duration, dtype: object

Use the .strip() method to strip duration of "minutes" and store it in the duration_trim column.
Convert duration_trim to int and store it in the duration_time column.
Write an assert statement that checks if duration_time's data type is now an int.
Print the average ride duration.

In [10]:
ride_sharing['duration_trim'] = ride_sharing['duration'].str.strip("minutes")
ride_sharing['duration_time'] = ride_sharing['duration_trim'].astype('int')

In [11]:
assert ride_sharing['duration_time'].dtype == 'int'

In [12]:
print(ride_sharing[['duration','duration_trim','duration_time']])

         duration duration_trim  duration_time
0      12 minutes           12              12
1      24 minutes           24              24
2       8 minutes            8               8
3       4 minutes            4               4
4      11 minutes           11              11
...           ...           ...            ...
25755  11 minutes           11              11
25756  10 minutes           10              10
25757  14 minutes           14              14
25758  14 minutes           14              14
25759  29 minutes           29              29

[25760 rows x 3 columns]

In [13]:
print(ride_sharing['duration_time'].mean())

11.389052795031056

In [17]:
ride_sharing.head()

,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender,user_type_cat,duration_trim,duration_time
0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male,2,12,12
1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male,2,24,24
2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male,3,8,8
3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male,1,4,4
4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male,2,11,11

In [ ]:
# Convert ride_date to date
ride_sharing['ride_dt'] = pd.to_datetime(ride_sharing['ride_date']).dt.date

# Save today's date
today = dt.date.today()

# Set all in the future to today's date
ride_sharing.loc[ride_sharing['ride_dt'] > today, 'ride_dt'] = today

# Print maximum of ride_dt column
print(ride_sharing['ride_dt'].max())

In [27]:
dupl = ride_sharing.duplicated()
ride_sharing[dupl].head(3)

,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender,user_type_cat,duration_trim,duration_time
604,9 minutes,81,Berry St at 4th St,81,Berry St at 4th St,1225,2,1993,Male,2,9,9
15217,17 minutes,22,Howard St at Beale St,102,Irwin St at 8th St,492,3,1961,Female,3,17,17
18303,10 minutes,30,San Francisco Caltrain (Townsend St at 4th St),6,The Embarcadero at Sansome St,4442,1,1967,Male,1,10,10

In [32]:
dupli = ride_sharing.duplicated(subset='bike_id' , keep=False)
dupl

0        False
1        False
2        False
3        False
4        False
         ...
25755    False
25756    False
25757    False
25758    False
25759    False
Length: 25760, dtype: bool

In [33]:
dupl[dupl == True]

604      True
15217    True
18303    True
20170    True
dtype: bool

In [34]:
dupl_sorted = ride_sharing[dupl].sort_values('bike_id')
dupl_sorted

,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender,user_type_cat,duration_trim,duration_time
15217,17 minutes,22,Howard St at Beale St,102,Irwin St at 8th St,492,3,1961,Female,3,17,17
604,9 minutes,81,Berry St at 4th St,81,Berry St at 4th St,1225,2,1993,Male,2,9,9
18303,10 minutes,30,San Francisco Caltrain (Townsend St at 4th St),6,The Embarcadero at Sansome St,4442,1,1967,Male,1,10,10
20170,4 minutes,21,Montgomery St BART Station (Market St at 2nd St),343,Bryant St at 2nd St,5034,2,1993,Male,2,4,4

In [39]:
#Drop complete duplicates in ride_sharing and store the results in ride_dup.
ride_reomove_dup = ride_sharing.drop_duplicates()

In [40]:
ride_sharing.columns

Index(['duration', 'station_A_id', 'station_A_name', 'station_B_id',
       'station_B_name', 'bike_id', 'user_type', 'user_birth_year',
       'user_gender', 'user_type_cat', 'duration_trim', 'duration_time'],
      dtype='object')

In [44]:
# Create statistics dictionary for aggregation function
stat = {'user_birth_year' : 'min' , 'duration_time' : 'mean'}

In [46]:
ride_uniqe = ride_reomove_dup.groupby('bike_id').agg(stat).reset_index()
ride_uniqe

      bike_id  user_birth_year  duration_time
0          11             1985       7.000000
1          27             1970      12.500000
2          37             1956       7.000000
3          38             1960       8.666667
4          43             1963      12.285714
...       ...              ...            ...
1800     6147             1957       9.888889
1801     6234             1971      16.789474
1802     6235             1959       8.550000
1803     6315             1969       7.000000
1804     6638             1962       7.200000

[1805 rows x 3 columns]

In [48]:
dupl = ride_uniqe.duplicated(subset='bike_id' , keep=False)
dupl_rides = ride_uniqe[dupl==True]
dupl_rides

Empty DataFrame
Columns: [bike_id, user_birth_year, duration_time]
Index: []

In [49]:
assert dupl_rides.shape[0] == 0

## Deal with Duplicate values :
dupl = ride_sharing.duplicated()
ride_sharing[dupl].head(3)
### subset column
dupli = ride_sharing.duplicated(subset='bike_id' , keep=False)
dupl
dupl[dupl == True]
### Drop complete duplicates in ride_sharing and store the results in ride_dup.
ride_reomove_dup = ride_sharing.drop_duplicates()
### Create statistics dictionary for aggregation function
stat = {'user_birth_year' : 'min' , 'duration_time' : 'mean'}
ride_uniqe = ride_reomove_dup.groupby('bike_id').agg(stat).reset_index()
ride_uniqe

# Strategies with Duplicate values
### Strategy 1: Remove duplicates entirely
### Strategy 2: Remove duplicates based on specific columns
### Strategy 3: Mark duplicates and handle them manually
### Strategy 4: Aggregate duplicates

In [1]:
import pandas as pd
# Create a dataset with duplicate data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Eva', 'Bob', 'Gaby'],
    'Age': [30, 25, 35, 30, 24, 25, 21],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'San Francisco', 'Los Angeles', 'Boston']
}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   30       New York
1      Bob   25    Los Angeles
2  Charlie   35        Chicago
3    Alice   30       New York
4      Eva   24  San Francisco
5      Bob   25    Los Angeles
6     Gaby   21         Boston

In [2]:
# Strategy 1: Remove duplicates entirely
df_clean = df.drop_duplicates()
print("Strategy 1: Remove duplicates entirely\n", df_clean)

Strategy 1: Remove duplicates entirely
       Name  Age           City
0    Alice   30       New York
1      Bob   25    Los Angeles
2  Charlie   35        Chicago
4      Eva   24  San Francisco
6     Gaby   21         Boston

In [3]:
# Strategy 2: Remove duplicates based on specific columns
df_clean_name = df.drop_duplicates(subset=['Name'])
print("\nStrategy 2: Remove duplicates based on specific columns\n", df_clean_name)

Strategy 2: Remove duplicates based on specific columns
       Name  Age           City
0    Alice   30       New York
1      Bob   25    Los Angeles
2  Charlie   35        Chicago
4      Eva   24  San Francisco
6     Gaby   21         Boston

In [4]:
# Strategy 3: Mark duplicates and handle them manually
df['is_duplicate'] = df.duplicated(subset=['Name'], keep=False)
print("\nStrategy 3: Mark duplicates and handle them manually\n", df)

Strategy 3: Mark duplicates and handle them manually
       Name  Age           City  is_duplicate
0    Alice   30       New York          True
1      Bob   25    Los Angeles          True
2  Charlie   35        Chicago         False
3    Alice   30       New York          True
4      Eva   24  San Francisco         False
5      Bob   25    Los Angeles          True
6     Gaby   21         Boston         False

In [5]:
# Strategy 4: Aggregate duplicates
df_agg = df.groupby('Name', as_index=False).agg({'Age': 'mean', 'City': 'first'})
print("\nStrategy 4: Aggregate duplicates\n", df_agg)

Strategy 4: Aggregate duplicates
       Name   Age           City
0    Alice  30.0       New York
1      Bob  25.0    Los Angeles
2  Charlie  35.0        Chicago
3      Eva  24.0  San Francisco
4     Gaby  21.0         Boston